app/controllers/authentications_controller.rb

  def index
    @authentications = Authentication.all
---
SELECT "authentications".* FROM "authentications"

  def create
    omniauth = request.env["omniauth.auth"]["info"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    useremail = User.find_by_email(omniauth['email'])
    if authentication
      flash[:notice] = "Signed in Successfully"
      sign_in_and_redirect(:user, authentcation.user)
    elsif useremail
      flash[:notice] = "Signed in Successfully"
      sign_in_and_redirect(:user, useremail)
    elsif current_user
      current_user.authentications.create(:provider => omniauth['provider'], :uid => omniauth['uid'])
      flash[:notice] = "Auth success"
      redirect_to authenticaions_url
    else
      user = User.new
      user.authentications.build(:provider => omniauth['provider'], :uid => ['uid'])
      user.email = omniauth['email']
      user.password = Devise.friendly_token.first(6)
      user.user_name = omniauth['nickname']
      user.save!
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'facebook' AND "authentications"."uid" = '10736185' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'rohithnp@u.washington.edu' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 05 Jun 2012 19:54:40 UTC +00:00], ["provider", nil], ["uid", ["uid"]], ["updated_at", Tue, 05 Jun 2012 19:54:40 UTC +00:00], ["user_id", 3]]
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2012-06-05 19:54:40.270705', "current_sign_in_at" = '2012-06-05 19:54:40.270705', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2012-06-05 19:54:40.271395' WHERE "users"."id" = 3